//1) Даны два массива: ['a', 'b', 'c'] и [1, 2, 3]. Объедините их вместе.=====================================

// const myArrayA = ['a', 'b', 'c'];
// const myArray1 = [1, 2, 3];
// newArray = Array.of(myArrayA,myArray1 );
// console.log(newArray);

//2) Дан массив ['a', 'b', 'c']. Добавьте ему в конец элементы 1, 2, 3. (через push и через splice)================

// const abc = ['a', 'b', 'c'];
// abc.push(1, 2, 3);
// console.log(abc);

// const abc2 = ['a', 'b', 'c'];
// abc2.splice(3, 0, 1, 2, 3,);
// console.log(abc2);

//3) Дан массив [1, 2, 3, 4, 5]. С помощью метода splice преобразуйте массив в [1, 4, 5].=====================
// const numbers145 = [1, 2, 3, 4, 5];
// numbers145.splice(1, 2);
// console.log(numbers145);

//4) Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 2, 3, 'a', 'b', 'c', 4, 5].=====

// const numbersAndLetters = [1, 2, 3, 4, 5];
// numbersAndLetters.splice(3, 0, 'a', 'b', 'c');
// console.log(numbersAndLetters);

//5) Дан массив const arr = [1, 2, 3, 4, 5]. Создать новый пустой массив arr1. Обойти массив arr через цикл for,
// каждый элемент массива arr умножить на 10 и результат положить в массив arr1.===============================

// const arr = [1, 2, 3, 4, 5];
// const arr1 = [];
//
// arr.forEach((item) => {
//     arr1.push(item * 10);
// });
// console.log(arr1);

//6) Вывести числа от 4 до 400 на экран.======================================================

// for (let i = 0; (i < 401); i++) {
//     if (i > 3)
//     console.log(i);
// }

//7) Вывести числа в последовательности: 4 7 10 13 с помощью цикла.===============================

// for (let i = 1; (i < 14); i += 3) {
//     if (i > 3)
//         console.log(i);
// }

//8) Вывести числа 654 653 652 до нуля.=================================================

// let i = 654;
//
// while (i >= 0) {
//     console.log(i);
//     i--;
// }

//9) Вывести все годы с 1983 до 2017.



























